Repository: shoreless-Limited/oauth2-gitlab
Catalog: i18n/*/strings.xlf
Languages: de_de

source: The Bug Genie can use %gitlab_icon GitLab OAuth2 (%link_to_gitlab_oauth) as an identity provider for user authentication and registration.
de_de: The Bug Genie kann %gitlab_icon GitLab OAuth2 (%link_to_gitlab_oauth) als Identitätsprovider zur Authentifizierung und Registrierung von Benutzern verwenden.

source: To authenticate with GitLab OAuth2, GitLab requires that you create a client key specific to this installation. To do this, follow the instructions under "Adding an application through the profile", here: %link_to_gitlab_oauth
de_de: Für die Authentifzierung mittels GitLab OAuth2 müssen Sie in GitLab einen Anwendungsschlüssel für The Bug Genie generieren. Folgen Sie hierzu den (englischen) Anweisungen im Abschnitt "Adding an application through the profile" der Benutzerdokumentation: %link_to_gitlab_oauth

source: When prompted, use the values listed below, then input the values of the client id and client secret here.
de_de: Wenn Sie dazu aufgefordert werden, verwenden Sie die nachfolgenden Werte. Dann tragen Sie die Anwendungs-ID und den Anwendungs-Schlüssel hier ein.

source: Settings saved
de_de: Einstellungen gespeichert

source: GitLab Server Domain
de_de: GitLab Server-Domain Adresse

source: Client ID
de_de: Anwendungs-ID

source: Client Secret
de_de: Anwendungs-Schlüssel

source: Login Button Label
de_de: Bezeichnung der Anmelde-Schaltfläche

source: Save
de_de: Speichern

source: %regular_login or %persona_or_openid_login
de_de: %regular_login oder %persona_or_openid_login

source: Use GitLab
de_de: GitLab verwenden

source: GitLab authentication not configured
de_de: GitLab-Authentifizierung nicht eingerichtet

source: Invalid login request
de_de: Ungültiger Anmeldeversuch

source: An unknown error occurred
de_de: Ein unbekannter Fehler ist aufgetreten
